Вариант 29
Задание:
Напишите программу в Colab, которая выполняет следующие шаги:
1. Пользователь вводит текстовую строку, содержащую несколько слов.
2. Программа должна:
a. Разделить строку на слова и создать список слов.
b. Создать новый список, где каждое слово записано в виде: каждая
буква в верхнем регистре через пробел (например, "Python" → "P
Y T H O N").
3. Подсчитайте:
a. количество слов в исходной строке,
b. количество символов в новом списке слов (включая пробелы между
буквами).
4. Создайте строку, объединяя все слова нового списка через |.
5. Создайте кортеж, содержащий исходный список слов, новый список слов,
количество слов и количество символов.
6. Выведите тип всех переменных, список, строку и кортеж.
7. Проверка: если количество символов нового списка > 20, выведите True,
иначе False.
Требования:
• Использовать str, list, tuple, int, bool.
• Обязательны: строковые методы, циклы, списки, кортежи, логические
выражения.
• Студент должен самостоятельно реализовать преобразование регистра и
вставку пробелов между буквами.
## Код
words = input("Введите строку с несколькими словами: ").split
new_words = []

for word in words:

    transformed = ""

    # Цикл по буквам

    for i, letter in enumerate(word):

        transformed += letter.upper()

        if i != len(word) - 1:  

            transformed += " "

    new_words.append(transformed)
word_count = len(words)
char_count = 0

for item in new_words:

    char_count += len(item)

joined_string = "|".join(new_words)

result_tuple = (words, new_words, word_count, char_count)

print("Тип переменной words:", type(words))

print("Тип переменной new_words:", type(new_words))

print("Тип переменной word_count:", type(word_count))

print("Тип переменной char_count:", type(char_count))

print("Тип переменной joined_string:", type(joined_string))

print("Тип переменной result_tuple:", type(result_tuple))


print("\nСписок исходных слов:", words)

print("Новый список слов:", new_words)

print("Объединённая строка:", joined_string)

print("Кортеж:", result_tuple)


check = char_count > 20

print("\nПроверка (количество символов > 20):", check)